[{"post_id":1,"title":"I Found My Wings This Way","section":"blog-butterfly","tagline":"We all have our own ways to feel alive and to fly high. Passion is always heartfelt and soul-piercing. And here is mine!","tag":"Imagist Poetry / Lyrical / Symbolist ","revealphrase":"Where do you fly?","content":[{"type":"list","data":["I had seen it with a bunch of papers bundled into one,","With ink and scratches;","My body felt like a pen,","so light and so handy,","to carry my wings and to lift me up in the air;","Between the clouds, between the dust,","In the dawn and at the dusk;","Far away and where I want my way,","Nestling to different places at different seasons;","When I search my mate,","When I search my food,","When I meet my fate,","When I want it all good,","With all my wings and body afloat in the sky!"]}]},{"post_id":2,"title":"A Ponderer's Ode","section":"blog-space","tagline":"Isn't it amazing to know that we are but a little sprinkle of sweeping stardust? Even our most overwhelming emotions are so puny in the grand scheme of things. Here is a verse to ponder!","tag":"Free Verse / Philosophical / Contemplative","revealphrase":"Oh! Aren't you Curious?","content":[{"type":"list","data":["Through Bond and Ties,","Each of us are connected as a miniscule of details,","Emoting and Sensing every minute,","Tied and woven to each other as a Fabric,","","A Fabric encompassing this little round rubble of the vast Universe, ","What happens when a mind ponders to look beyond from what is known?","Into the farther and into the Unknown;","Into the origins and into the beginning!","","We, the Anomaly of the infinite,","A chance that took many Billion years to create,","A miracle or debacle of nature,","With no significance of The Vast,","Stumbling into the trivial,","Treading in uncertainty, ","Obsessing the puny!","","Are we, but a ridicule to the Unknown?","The very thing that makes us Human,","Unmakes us as well,","The Curiosity - Do you Risk it?"]}]},{"post_id":3,"title":"பாரதியின் காதலி","section":"blog-wavy","tagline":"Having read the poems of Bharathiyar, I often wondered who his muse was. There is always a woman in his poems, in his dreams, in his visions. He was ahead of his time when it came to feminism and modern thoughts. Here is a poem that reflects on the women in his words.","tag":"Lyrical Poetry / The Muse / Literary Tribute ","revealphrase":"அவள் யாரோ?","content":[{"type":"list","data":["அவள் காதலியோ,","அல்ல தேன் கவியோ,","அல்ல தமிழ் மொழியோ…","நில்லடி என்றதும் காலடி பதித்த பாவையோ,","சொல்லடி என்றதும் ததும்பிடும் மொழிக்கோர்வையோ;","பாரடி என்றதும் தம் கருவிழியில் கருத்தினை தேக்கிடுவாளோ,","கேளடி என்றதும் தன் மௌனத்தை கூட சேமித்திடுவாளோ;","நினைக்கும் பொழுதிலே தோன்றுபவளாவாளோ,","வாழ்கை துணைவியாவாளோ,","வானம் எழ தம் எண்ணங்களின் துணையாவாளோ;","தனக்கு இணையாய் இருக்கும் சிவசக்தியோ,","அல்ல இமையாய் இருக்கும் கண்ணம்மாவோ;","காகிதத்தில் ஒளிந்திருக்கிறாளோ,","அல்ல காவியத்தில் மலர்ந்திருக்கிறாளோ;","மௌனமாய் மொழிந்தவளோ,","அல்ல காட்சியாய் புகுந்தவளோ;","மெதுவாய் அமர்ந்தாளோ உன்னருகே,","உம் மொழியை உணர்தாளோ கண்ணருகே !","ஒவ்வொரு வாக்கிலும் அமர்ந்திட்டாள்,","அவள் பாரதியின் மொழியில்லல்ளோ நுழைந்திட்டாள் !","பெண் ஓவியமோ அவள்,","அல்ல என் பொறாமையின் பாத்திரமோ அவள்,","இல்லை யாருக்கும் கிட்டா பாக்கியம் கொண்டவளே இவள் !"]}]},{"post_id":4,"title":"Call her Meow!","section":"blog-cat","tagline":"Oh, those little guys! You never know where they came from or where they'll go, but they leave a lasting impression that almost never fades. Here is one of their stories.","tag":"Narrative Non-fiction / Memoir / Melancholic ","revealphrase":"Did you listen to her Mew?","content":[{"type":"para-i","data":"I’m not an animal lover, nor have I ever had a pet before.","highlight":[]},{"type":"para-i","data":" I have never engaged in arguments advocating for animal welfare.","highlight":[]},{"type":"para-i","data":" I belong to that category of people who watch channels like Discovery and Nat Geo, enjoying the skillful attacks of the cat and dog families as they prowl and pounce on each other—all while having a meal.","highlight":[]},{"type":"para-i","data":"I'm a foodie; giving up my love for non-vegetarian food seems unimaginable.","highlight":[]},{"type":"para-i","data":"  I am nowhere close to people who make sympathetic and dramatic talks about the injustice happening to the lovable species that have coexisted with us since our evolution. ","highlight":[]},{"type":"para-i","data":"In fact, this isn't just about me—take it for granted, my entire family is quite the same!","highlight":[]},{"type":"img-divider","icon":"quiet-street"},{"type":"para","data":"Our house is a bit old-fashioned in appearance, and we have maintained its antiquity by dumping all sorts of age-old broken folding chairs, tables, pipes, and unused items in the backyard, filling it with debris. There are also rooms that have never been visited.","highlight":[]},{"type":"para","data":" Such a place would never invite anyone—except for the ever-roaming cats that keep changing their spots every now and then.","highlight":[]},{"type":"para","data":" These cats are always a nuisance; they sneak food, drink milk, make a mess, and abscond from the scene. Sometimes they are fun, but most of the time, they are annoying. If you pity them once and feed the little kittens with milk, they will eventually take advantage of your sympathy. From childhood, I have seen many such cat siblings come and go.","highlight":[]},{"type":"para","data":"At the same time, I must admit that they can be cute, especially when they play. But once they catch you watching, they flee the scene.","highlight":[]},{"type":"img-divider","icon":"Catvase"},{"type":"para","data":" One such visitor was this cat—Kitty. She wasn’t particularly pretty—her shades of grey, white, and black stripes, along with her light yellowish-brown eyes, gave her a look as if she were part of the night’s shadows. One glance at her, and you could tell she was a typical street cat, bony and cold. Her eyes said it all:","highlight":[]},{"type":"para-i","data":" “I’ve just come to sneak into your kitchen, and you better stay away!”","highlight":[]},{"type":"para","data":"In the beginning, she was just another cat.","highlight":[]},{"type":"para","data":" It was fun chasing her away, and in return, she would give a stern look, full of pride inherited from her feline ancestors. ","highlight":[]},{"type":"para","data":"If we weren’t watchful, she would get into the kitchen, drink all the milk, and leave us without our evening drink. At night, she would sneak into the house and wake us up with her meows, hiding under the cot. The entire night would be spent trying to chase her out. ","highlight":[]},{"type":"para","data":"This was how our initial relationship with her was—marked by her unruly nature and us bullying her to stop her mischief.","highlight":[]},{"type":"img-divider","icon":"cat-play"},{"type":"para-i","data":"Somehow, our relationship evolved.","highlight":[]},{"type":"para","data":"It has been almost five to six months since we first met her. Whenever we went to the backyard, she was always there to amuse us. When we were low, watching her play was soothing. ","highlight":[]},{"type":"para","data":"If we threw dry leaves at her, she would crush them with her claws, making noises, and once done, she would look at us as if asking for more toys.","highlight":[]},{"type":"para","data":" She was good at talking, too. If we meowed shrilly, she would respond the same way; if we lowered our voices, she would match our tone. This communication made our bond stronger. She would call us with her faint meows, gently trying to talk.","highlight":[]},{"type":"para-i","data":" She wanted company—maybe even a family that could take care of her.","highlight":[]},{"type":"img-divider","icon":"happy-music"},{"type":"para","data":"Whenever she needed food, she would circle us, never letting us walk further until she got something to eat. Thus, it became a habit to feed her our leftovers and share some milk whenever she cried. She never even managed to catch the rats that ran around the garden. ","highlight":[]},{"type":"para","data":"Once, we pointed at a rat sitting close to her and asked her to catch it. No response—she simply continued crying for food. We teased her,","highlight":[]},{"type":"para-i","data":" “You are such a lazy cat. You don’t even qualify as one!”","highlight":[]},{"type":"para","data":"If we gave her rusk soaked in milk, she would smartly lick off the milk and look at us for more. How clever!  We’d say,  ","highlight":[]},{"type":"para-i","data":"“Eat this, or you won’t get anything!”","highlight":[]},{"type":"para","data":"Once, she didn’t like what we gave her and let out a loud meow before jumping over the compound wall—only to return later to eat the same food. Her cute antics always kept us entertained. She was slowly becoming part of our family.","highlight":[]},{"type":"img-divider","icon":"lazycat"},{"type":"para","data":" My mom, being a housewife, usually gets bored after finishing her daily chores. Kitty would circle her whenever she found her in the backyard, asking for food. Neither my sister nor I noticed the quiet friendship blossoming between my mom and Kitty. Soon, my mom began to greatly enjoy her company.","highlight":[]},{"type":"para","data":"One day, she sneaked into the kitchen in our absence and got caught by my mom. Mom shooed her away and ignored her for a few days.","highlight":[]},{"type":"para","data":" From then on, even when hungry, Kitty would wait at the kitchen door, calling us with her faint meows. She would cautiously step inside, looking at my mom—if she smiled, she would proceed; if not, she would step back. My mom played along, changing her expressions. ","highlight":[]},{"type":"para","data":"Kitty could so beautifully read emotions. No other cat had ever dared come close to us, but she did. Sometimes, she even licked our feet and rubbed against our legs. Such a compassionate cat she was!","highlight":[]},{"type":"img-divider","icon":"friends"},{"type":"para","data":"In the midst of all this, we began to notice something—Kitty wasn’t alone. ","highlight":[]},{"type":"para","data":"She was expecting kittens. Her bulging belly and frequent tiredness kept her in our house the whole day. She would always sit by the kitchen door.","highlight":[]},{"type":"para","data":" Especially Sundays were her favorite; she would never leave because it was non-vegetarian food day! When we gave her bones and meat, her body would arch in excitement, shivering with joy. It felt good to see her so happy.","highlight":[]},{"type":"para","data":"As days passed, we eagerly awaited the arrival of her kittens. ","highlight":[]},{"type":"para","data":"A white cat often roamed with Kitty, leading us to guess he might be the father. Would the kittens be fully white, fully ash, or a mix? When she was sleeping, it felt like we were able to watch these little ones move in her belly and tried to guess the number of kittens. All of us were so excited for the new arrival.","highlight":[]},{"type":"para","data":" My mom casually once mentioned that cats often leave to deliver their kittens elsewhere, but we couldn't imagine Kitty doing that. She was lazy and, more importantly, dear to us.","highlight":[]},{"type":"img-divider","icon":"cat family"},{"type":"para","data":"It was just another Saturday.","highlight":[]},{"type":"para","data":" Everything was normal.","highlight":[]},{"type":"para","data":"Kitty was too tired to jump over the walls. Maybe it was almost time for the kittens' arrival. She lazed around all day.","highlight":[]},{"type":"para","data":" I felt a little mischievous and barked at her, knowing cats hate dogs. She gave me a strange look and moved away. When I meowed, she responded weakly.  ","highlight":[]},{"type":"para-i","data":"Something was off.","highlight":[]},{"type":"para","data":"She was giving faint meows despite having food. We thought she would be fine.","highlight":[]},{"type":"para","data":"That night, she slept in our car shed as usual. That’s the place she crashed herself for her night stay.","highlight":[]},{"type":"img-divider","icon":"sleeping"},{"type":"para","data":"It was in the wee hours of the morning, at around 2 AM, when we heard the dogs barking. The nights were usually filled with noises from street dogs, barking and fighting each other.","highlight":[]},{"type":"para-i","data":"We thought it was just another night show.","highlight":[]},{"type":"para","data":"Until suddenly, the barks came closer,as if being heard from inside our compound.","highlight":[]},{"type":"para","data":"Within minutes, we heard a loud cry, as if someone was being pounced to death.","highlight":[]},{"type":"para","data":" It was a death cry. ","highlight":[]},{"type":"para","data":"It stopped within a few seconds. We couldn’t figure out what the cry meant and from where it came. We rushed out with a torch and a stick. We saw a street dog running! We weren’t able to understand how it managed to cross the 8-foot compound wall.","highlight":[]},{"type":"para","data":" Soon, we realized that the death cry was from our very own Kitty.","highlight":[]},{"type":"para","data":" She was bitten at the neck and stomach.   ","highlight":[]},{"type":"para","data":"No movement.","highlight":[]},{"type":"para","data":"No breath.","highlight":[]},{"type":"para","data":"She was gone.","highlight":[]},{"type":"img-divider","icon":"heartbroken"},{"type":"para","data":"No excuse could ease our regret. The dogs had never entered our compound before.","highlight":[]},{"type":"para","data":"We couldn’t imagine the kind of fate she had faced. She must have been too tired to save herself. It all happened in a fraction of a second. She lay there miserably, motionless. ","highlight":[]},{"type":"para-i","data":"She is gone. Her kittens, gone.","highlight":[]},{"type":"para-i","data":"She gave us love, and now that love is gone. ","highlight":[]},{"type":"para","data":"She shouldn’t have died such a cruel death. Fate was unfair. We couldn’t sleep the whole night. We were devastated.","highlight":[]},{"type":"para-i","data":"It was Sunday. Her favorite day of the week. ","highlight":[]},{"type":"para","data":"Our house was unusually silent. None of us wanted to talk. None of us wanted to have our food. The day didn’t have any life at all.  ","highlight":[]},{"type":"para","data":"The backyard was empty. No sounds. No mischief. No massages. It was hard to digest.","highlight":[]},{"type":"para","data":"Now, there wasn’t any visitor. Every time a cat comes in, it comes in uninvited and goes out without a farewell. She was just another street cat, but her farewell was the hardest to bear.","highlight":[]},{"type":"para-i","data":"And yet, she lives on—through these words, through our memories. She lingers in our lives a little longer.","highlight":[]},{"type":"para-i","data":"As this is the least I can do for her.","highlight":[]},{"type":"para-i","data":"This story is a tribute to my most lovable Kitty and dedicated to all the pet lovers.","highlight":[]},{"type":"para-i","data":"( We named her 'Kitty' only after she was gone. Until then, she was called 'Meow. )","highlight":["( We named her 'Kitty' only after she was gone. Until then, she was called 'Meow. )"]}]},{"post_id":5,"title":"Muted Whispers","section":"blog-gramophone","tagline":"Have you ever felt the feeling of missing yourself, the longing for what you could be? This free verse poem explores the themes of one's own whispers.","tag":"Free Verse / Existential / Introspective","revealphrase":"Can you hear?","content":[{"type":"list","data":["Where are my words slipping away?","Into an endless abyss,","Until the unknown depths,","Into the unheard clutters,","And up to the unlived times.","","The notes of my strings,","Faded;","The whistles of the wind,","Devours;","The lines of my songs,","Melted;","The chatters of my mind,","Maddens.","","I could handle murmurs,","I could settle chaos,","I could battle echoes,","Alone for eons,","But what of the deafening stillness,","And the whispers that made me?","","When will they ring back?","Bringing me,","the sounds of my soul,","the songs of my heart,","And the hums of my dreams!","","Will I ever hear it?","Do they still rustle?","Is there any rescue?","An escape from the sublime!"]}]},{"post_id":6,"title":"What It Means to Fall in Love with Night?","section":"blog-moon","tagline":"When do you mostly feel creative? When do you feel like yourself?  We all have our own time and rhythm, don’t we?","tag":"Romanticism / Philosophical Poetry / Contemplative","revealphrase":"Don't we all Love?","content":[{"type":"list","data":["What it means to fall in love with night?","Its Romanticism personified,","Words falling light,","Silence making tunes,","Thoughts hugging tight,","And immense feeling fumes,","","There is no you,","no me,","Nobody to see me,","Into my shadows,","Into my hollows,","Into my memories,","In my territories,","Devouring the world whole,","Becoming an entirety!","","There is one boss, that’s me,","There is one slave, that’s me,","There is one path that I move,","The only thing I have known,","Blindfolding my eyes,","Enfolding oneself,","Into the darkness I succumb,","From its depth I emerge.","To truly know oneself,","Fall in Love with night!"]}]},{"post_id":7,"title":"When Was the Last Time?","section":"blog-rain","tagline":"Aren't these little things that once felt like they belonged, the ones that prick hard when missed? Aren't the small things we thought were trivial, all we need to feel alive again?","tag":"Reflective Poetry / Spirutual / Natue Love","revealphrase":"Do you miss it?","content":[{"type":"list","data":["When was the last time - ","When the breeze touched me? ","and when the raindrops kissed me? ","Taking me in,","into deep, ","into a whole new world, ","Where I had my soul and peace! ","","When was the last time-","When my heart beat drummed with the pouring rain? ","When my words were devoid of coming out in vain? ","When was it?","Caught in between Time and Life,","Away from love,","Away from mine,","Away from everything,","that touched my heart!","","Into the world, into many places, ","Into the real, into many voices, ","Into all that, that do not belong to me,","Into what again will I find myself?","","Is it a wait?","Will it be light?","Or is it a sign to prepare for the world? ","","So closed, so bound,","back to the womb, ","like a cocoon waiting for rebirth,  ","to get my soul back…"]}]},{"post_id":3,"title":"உறவுகள் உணருமோ","section":"blog-kite","tagline":"Between love and despair, between blood and dreams, why is there always a tug of war? Why is it that one mostly doesn’t understand the other? This poem delves deep into tapping these emotions and the struggles that come with it.","tag":"Philosophical Poetry / Emotional / The Human Condition","revealphrase":"உணர்வுகள் கேட்குமோ?","content":[{"type":"list","data":["எட்டி நிற்க்கும் வானத்திற்கு முற்றும் என்றும் உள்ளதோ,","தொட்டு விட எண்ணி விட்டம் அதை நோக்கி ,","பற்றி கொண்ட கயிற்றை பட்டம் விட்டு சென்றதேன்?","","உச்சி அதை காண மெச்சியதை கொள்ள,","நிச்சயத்துடன் நெஞ்சம் படிப்படியாய் உழியை பதித்ததோ,","மிச்சமுள்ள சொட்ச உயரத்தை கடக்க கால்கள் பதறியதேன்?","","மங்கும் நேரமன்று மழையும் தூரக்கொண்டு,","வெட்ட வெளியில் வட்ட தோரணையில் வானவில் வண்ணத்தை தீட்டியதோ,","கதிர்கள் பிரதிபளிக்கும் வேலையில் ஓடம் அதை கலைத்ததேன்?","","ஓடும் பல தூரம் நாடும் சில சொந்தம் ,","வழிகள் பல கடந்து வலியில் கால்கள் துடிக்கிறதோ?","மஞ்சம் வந்து சேர பந்தம் ஒன்று கொண்டும் அதை உணர மந்தமேன்?"]}]}]
