[{"project_id":1,"title":"Qbuilder","tagline":"The Best of Both Worlds.","tags":["#HealthcareTech","#QueryAutomation","#SelfServiceAnalytics "],"content":[{"type":"header","data":"In a Nutshell "},{"type":"para","data":"QBuilder is a data analytics tool that lets users create, modify, and save dynamic queries—without needing SQL expertise. Its intuitive interface delivers quick access to complex insights, bridging the gap between simplicity and power.","highlight":[]},{"type":"header","data":"Technologies"},{"type":"tech_stack","data":[{"icon":"frontend","name":"Front-End","list":["Angular CLI","HTML5, CSS3"," Bootstrap","JQuery","JavaScript"]},{"icon":"backend","name":"Back-End","list":["ASP.Net","Web API"]},{"icon":"visualization","name":"Data Visualization","list":["D3.js","SVG"]},{"icon":"database","name":"Database","list":["SQL"]}]},{"type":"header","data":"The Big Business Behind "},{"type":"para-i","data":"QBuilder powered ClaimSphere, a suite of tools built for HEDIS data—the backbone of U.S. healthcare performance metrics. With over 90% of health plans relying on HEDIS, this data impacts 235 million Americans (61% of the U.S. population). In 2024 alone, the U.S. government allocated $600 billion in incentives to top-performing Medicare and Medicaid health plans.","highlight":[]},{"type":"para","data":"These healthcare providers were our primary customers, leveraging ClaimSphere to enhance their ratings by:","highlight":[]},{"type":"list-bar","data":["Identifying care gaps at the measure level.","Analyzing historical and real-time data.","Generating actionable insights and future projections."]},{"type":"header","data":"The Need & The Challenge"},{"type":"para","data":"Analysts needed speed. SQL offered power, but complexity slowed them down. Our challenge? Build a tool that felt like Excel but worked like SQL—fast, intuitive, and scalable. The goal was to reduce analysis time across various data categories and minimize reliance on backend teams, empowering analysts and business users with limited technical expertise.","highlight":["Analysts needed speed."]},{"type":"header","data":"Building a Powerful Yet Simple Experience"},{"type":"quote","data":"A great UI feels natural—users shouldn’t need a manual, even for complex tasks!","tagline":"A valuable lesson from my mentor stuck with me:"},{"type":"para","data":"To achieve this, I designed features that combined spreadsheet simplicity with SQL power, ensuring users could analyze data effortlessly:","highlight":[]},{"type":"features","data":[{"icon":"drag","title":"Drag-and-Drop Query Builder","description":"Visually select tables, columns, and filters to construct queries without writing SQL."},{"icon":"operators","title":"Button-Based Operators & Clauses","description":"Simplified query creation and modification with intuitive UI elements."},{"icon":"spreadsheet","title":"Spreadsheet-Like Functions","description":"Edit, cut, add/delete columns, and manipulate data dynamically."},{"icon":"management","title":"Built-In Query Management","description":"Save, rename, and download queries for future use."},{"icon":"addvisualization","title":"Integrated Data Visualization","description":"Transform raw data into actionable insights in real time."}]},{"type":"header","data":"Overcoming the Hurdle"},{"type":"para","data":"Turning user actions into SQL queries—without breaking the intuitive experience—was a major challenge. By breaking down operations, recognizing patterns, and structuring a dynamic query engine, I built a system that could generate SQL queries seamlessly via a simple UI.","highlight":["generate SQL queries seamlessly via a simple UI"]},{"type":"header","data":"Data Visualization & Performance Optimization"},{"type":"para","data":"Beyond querying, QBuilder included powerful data visualizations to make insights more accessible. One such feature was a sunburst graph for identifying non-compliant members requiring follow-up.","highlight":[]},{"type":"para","data":"Use Case: Visualizing Noncompliance through Interactive Graph Analysis","highlight":["Use Case: Visualizing Noncompliance through Interactive Graph Analysis"]},{"type":"para","data":"Users could drill down through multiple levels: ","highlight":[]},{"type":"drill","data":["Select a county","View plan categories (e.g., Medicare)","Identify providers in that region","Locate plans rated below 4 stars","Click on a plan to view a list of non-compliant members"]},{"type":"header","data":"Optimizing for Performance"},{"type":"para","data":"Rendering visualizations on large datasets led to performance bottlenecks. Instead of querying massive datasets in real-time, I pre-processed and aggregated data dynamically based on predefined conditions. This optimization drastically improved performance, making the system lightweight and efficient.","highlight":["pre-processed and aggregated data dynamically","improved performance","lightweight and efficient"]},{"type":"header","data":"My Role"},{"type":"para","data":"When I joined the QBuilder team, the application had only a basic layout. I played a key role in designing and developing most of its UI features, transforming it into a fully functional analytics tool.","highlight":[]},{"type":"header","data":"Key Contributions"},{"type":"list","data":["Designed & optimized the drag-and-drop query builder.","Developed dynamic query generation for seamless SQL execution.","Implemented advanced data visualization for actionable insights.","Collaborated with Architects & Business Analysts to align features with real-world use cases.","Led development from PoC to customer implementation, shaping QBuilder into a core product within the ClaimSphere suite."]},{"type":"header","data":"Final Thoughts"},{"type":"para","data":"QBuilder wasn’t just an analytics tool—it redefined how analysts interacted with data. By bridging the gap between SQL and simplicity, it became a go-to solution, dramatically cutting analysis time and boosting usability and being part of this transformation was an incredible journey! ","highlight":["redefined how analysts interacted with data"]}]},{"project_id":2,"title":"HEDIS Analytics Dashboard","tagline":"Lasting Impressions.","tags":["#DataAnalytics","#DashboardDesign","#HighImpactPresentation"],"content":[{"type":"header","data":"In a Nutshell "},{"type":"para","data":"As part of ClaimSphere, our product suite, we developed a series of HEDIS Analytics Dashboards to study HEDIS data( a standardized set of 92 performance measures used by over 90% of U.S. health plans (Medicare, Medicaid, and Pharmacy) across various counties.","highlight":[]},{"type":"header","data":"Technologies"},{"type":"tech_stack","data":[{"icon":"analytics","name":"Data Analytics","list":["Power BI"]},{"icon":"database","name":"Database","list":["SQL"]}]},{"type":"header","data":"Use Cases"},{"type":"para","data":"These dashboards delivered key insights that empowered analysts to:","highlight":[]},{"type":"list-bar","data":["Conduct competitor comparative analysis","Examine demographic distribution trends"," Evaluate health plans by category"]},{"type":"para","data":"which became key pitch assets, demonstrating ClaimSphere’s ability!","highlight":["key pitch assets"]},{"type":"header","data":"Key Takeaways"},{"type":"para","data":"One of my biggest challenges was translating the complexities of healthcare and insurance systems into actionable insights. To bridge this gap, I collaborated with senior managers, analysts, and developers, diving deep into product intricacies and key metrics to craft impactful dashboards.","highlight":["translating the complexities of healthcare and insurance systems into actionable insights"]},{"type":"para","data":"This project pushed me beyond technical skills, deepening my understanding of how UI/UX shapes data interpretation. I became more aware of how we unconsciously process visual data, refining my approach to design and decision-making in analytics.","highlight":["how UI/UX shapes data interpretation"]},{"type":"header","data":"The Nuances of UI Design & Dashboard Building"},{"type":"features","data":[{"icon":"datapoints","title":"The Design Matters ","description":"Dashboard design isn’t just about layout; it’s about leveraging human psychology. Colors, structure, and flow shape user engagement and comprehension. It’s essentially an art!"},{"icon":"databoard","title":"The Power of Visual Storytelling ","description":"A great dashboard doesn’t just present numbers—it guides focus and tells a compelling story."},{"icon":"dataprocessing","title":"The Data Needs","description":"Data is often scattered across multiple databases, making aggregation and validation complex. To address this problem, streamlining data processes becomes essential, ultimately inspiring the development of QBuilder."}]},{"type":"header","data":"A Special Use Case: The Healthcare Conference"},{"type":"header","data":"The ASK"},{"type":"para","data":"Initially, the team planned a traditional PowerPoint presentation. But with so much data, the message risked getting lost. Our Project Director posed a last-minute question: Could we demonstrate how our product helps health plans secure government incentives?","highlight":["Could we demonstrate how our product helps health plans secure government incentives?"]},{"type":"header","data":"The Statement"},{"type":"para-i","data":"With over $500 billion spent on Medicare and more than $100 billion on Medicaid in 2024 alone, health plans receive financial rewards based on performance. For example, a 3.5-star plan may miss out on incentives, while a 4-star plan qualifies for financial aid. Our products help plans bridge this gap. We needed a way to clearly demonstrate how much revenue these lower-rated plans are losing — and why our product is indispensable in helping them achieve better performance and secure those financial rewards.","highlight":["demonstrate how much revenue these lower-rated plans are losing — and why our product is indispensable"]},{"type":"header","data":"The Solution: An Interactive Dashboard"},{"type":"para","data":"Despite time constraints scrapping the idea, I found it too compelling to ignore. Over the weekend, I: ","highlight":[]},{"type":"list-bar","data":["Sketched a layout","Created mock data and","Designed the dashboard "]},{"type":"paraimg","data":{"icon":"analyticsbi","description":"I wanted the visuals to stand out, especially on a big projector screen, so I made them dark-themed with golden-yellow accents—symbolizing both the gold standard and the money on the table."}},{"type":"para","data":"By Sunday, my design was ready. When my team called to discuss building the dashboard, I surprised them with a fully designed version. Their reaction? Thrilled. The work was done—and it exceeded expectations.","highlight":["I surprised them with a fully designed version"]},{"type":"header","data":"The Outcome"},{"type":"list","data":["Game-Changer at the Conference.","Delivered a single-shot, high-impact visual experience.","Earned direct appreciation from the Project Director.","Generated strong client interest, leading to new business opportunities."]},{"type":"para","data":"Though not my biggest project, this was one of the most fulfilling—a moment where I understood the assignment and executed it exceptionally well. Every design choice was noticed and appreciated. My client in this case was my Project Director, who wanted to leave a lasting impression at the conference. This success wasn’t just mine—it was a collaborative win. While I focused on design and storytelling, my teammate handled data and hosting, making it a seamless execution.","highlight":["a moment where I understood the assignment and executed it exceptionally well"," Every design choice was noticed and appreciated"]},{"type":"header","data":"Final Thoughts: The Art of Data Storytelling"},{"type":"quote","data":"Data storytelling isn’t just about numbers—it’s about crafting an experience that leads to meaningful insights.","tagline":"This experience reinforced an essential lesson:"},{"type":"para","data":"Seeing my work recognized and appreciated at a critical moment was incredibly rewarding. Even more so, knowing that my efforts directly contributed to real business impact.","highlight":[]},{"type":"para-i","data":"This experience deepened my passion for being techno-functional—where design meets strategy to create purpose-driven, impactful solutions.","highlight":[]}]},{"project_id":3,"title":"Cockpit4Dia","tagline":"Revitalizing a Legacy System.","tags":["#ScalableArchitecture","#TechStackUpgrade","#FutureProofing"],"content":[{"type":"header","data":"In a Nutshell "},{"type":"para","data":"A mission-critical tool in ClaimSphere's suite, Cockpit4Dia simplifies backend job management across multiple SQL database engines. It provides a seamless UI for monitoring database operations, error logs, and job statuses—eliminating inefficiencies from manual database navigation and enhancing operational efficiency.","highlight":[]},{"type":"header","data":"Technologies"},{"type":"tech_stack","data":[{"icon":"frontend","name":"Front-End","list":["Angular CLI","HTML5, CSS3"," Bootstrap","JQuery","JavaScript"]},{"icon":"backend","name":"Back-End","list":["ASP.Net","Web API"]},{"icon":"database","name":"Database","list":["SQL"]}]},{"type":"header","data":"The Roadblock: A Delayed Migration"},{"type":"para","data":"Originally built on a legacy .NET codebase, Cockpit4Dia faced major scalability and maintenance challenges—especially during HEDIS season when rapid updates were critical. Despite its necessity, the migration to Angular CLI had been stalled for 4–5 years due to strict deployment timelines and technical dependencies.","highlight":["scalability and maintenance challenges","stalled for 4–5 years"]},{"type":"header","data":"Why Migration Was Critical?"},{"type":"features","data":[{"icon":"scaleui","title":"Scalability & Performance ","description":"Efficiently handling growing workloads."},{"icon":"speed","title":"Maintainability & Speed ","description":"Accelerating feature development."},{"icon":"modern","title":"Modern UI/UX ","description":"Improving usability for non-technical users"},{"icon":"micro","title":"Future-Proofing ","description":"Aligning with microservices & modern APIs"}]},{"type":"para","data":"With limited time and a backlog of pending features, the challenge was to modernize the tech stack without disrupting ongoing operations.","highlight":[]},{"type":"header","data":"My Contribution"},{"type":"para","data":"Recognizing the urgency, I took initiative to revive the migration, collaborating closely with my team to drive a smooth and efficient transition.","highlight":["smooth and efficient transition"]},{"type":"list","data":[" Led the successful revival of a migration stalled for years.","Ensured operational stability, preventing disruptions during development.","Delivered a future-ready, high-performance application ahead of critical deadlines."]},{"type":"para","data":"This migration accelerated development cycles, improved maintainability, and enhanced usability, transforming Cockpit4Dia into a scalable and resilient tool within ClaimSphere’s suite.","highlight":["scalable and resilient tool"]},{"type":"header","data":"Final Takeaway"},{"type":"para","data":"This project reinforced my ability to bridge legacy and modern technologies, execute under high-pressure conditions, and drive mission-critical transformations with precision and efficiency.","highlight":[]}]},{"project_id":4,"title":"Troupe","tagline":"Truly, First is Best.","tags":["#MEANStack","#CustomizableDashboards","#DynamicUI"],"content":[{"type":"header","data":"In a Nutshell "},{"type":"para","data":"Troupe is a desktop application designed to streamline team collaboration across various categories. It introduces a priority-based messaging system that ensures users receive the most important updates without being overwhelmed by excessive notifications.","highlight":[]},{"type":"header","data":"Technologies"},{"type":"tech_stack","data":[{"icon":"frontend","name":"Front-End","list":["Angular 2","HTML5, CSS3"," Bootstrap","JQuery","JavaScript","Angular Material"]},{"icon":"backend","name":"Back-End","list":["Node.js","Express.js"]},{"icon":"visualization","name":"Data Visualization","list":["D3.js"]},{"icon":"database","name":"Database","list":["MongoDB","Redis"]}]},{"type":"header","data":"The Problem: Notification Overload"},{"type":"para","data":"In traditional collaboration tools, users are often part of multiple groups and teams, leading to a flood of messages and notifications. Important updates can get lost in this noise, reducing efficiency and clarity. Troupe solves this problem by enabling users to set personalized priority levels for messages while also ensuring that critical organization-wide announcements override personal settings. This approach ensures that users always notice what’s most important while maintaining control over their own notification preferences.","highlight":["personalized priority levels for messages"]},{"type":"header","data":"Key Features"},{"type":"features","data":[{"icon":"tiles","title":"Customizable Dashboard Tiles ","description":" Users can personalize their dashboard with dynamic tiles displaying announcements. These tiles can: Change colors based on priority; Be resized and repositioned;Improve visibility of critical updates"},{"icon":"newmessage","title":"Priority Messaging & Announcements","description":" Users can set priority levels for different messages, ensuring that essential notifications stand out. Additionally, if a message is marked as critical for all users, it automatically takes precedence over personal priorities, guaranteeing that crucial updates are always noticed."},{"icon":"groupchat","title":" Seamless Team Collaboration ","description":"Facilitates real-time communication and workflow management without overwhelming users with excessive notifications."}]},{"type":"header","data":"My Contribution"},{"type":"para","data":"I designed and implemented the customizable dashboard tile system, ensuring interactivity and user engagement. By enabling dynamic resizing, repositioning, and priority-based color adjustments, I enhanced usability and flexibility.","highlight":["implemented the customizable dashboard tile system,"]},{"type":"para","data":"This feature became a standout aspect of the product, allowing users to visually prioritize key information effectively. My approach emphasized intuitive design, ensuring users could quickly identify critical updates while filtering out less urgent notifications.","highlight":["standout aspect of the product,","intuitive design,"]},{"type":"header","data":"The Journey & Impact"},{"type":"para","data":"Troupe was developed as part of my MEAN Stack training under StackRoute, an elite program in collaboration with NIIT. I was selected for this program based on:","highlight":["MEAN Stack training"]},{"type":"list-bar","data":["Top performance in Cognizant’s Early Coding Assessments"," Success in a competitive coding contest for freshers"]},{"type":"para","data":"Through this project, I gained hands-on experience in:","highlight":[]},{"type":"list","data":["Designing interactive UIs."," Implementing real-time communication features."," Building scalable, user-centric applications."]},{"type":"header","data":"Final Thoughts"},{"type":"para","data":"Troupe was my first major web development project, sharpening my problem-solving skills and deepening my understanding of full-stack development. This experience laid a strong foundation for my journey in creating dynamic and impactful digital experiences that balance functionality and user experience.","highlight":["understanding of full-stack development","dynamic and impactful digital experiences"]}]},{"project_id":5,"title":"Wierarchy","tagline":"Visuals for Thought.","tags":["#InnovationTracking","#InteractiveVisuals","#HackathonProject"],"content":[{"type":"header","data":"In a Nutshell "},{"type":"para","data":"Wierarchy is a data visualization application that analyzes, user-engagement in social media groups and its impact on innovation. By retrieving data from Yammer groups using the JavaScript SDK, the app generates interactive visualizations that help organizations identify key contributors and trending discussion topics driving innovation.","highlight":[]},{"type":"header","data":"Technologies"},{"type":"tech_stack","data":[{"icon":"frontend","name":"Front-End","list":["Angular 2","HTML5, CSS3"," Bootstrap","JQuery","JavaScript"]},{"icon":"backend","name":"Back-End","list":["Node.js","Express.js"]},{"icon":"visualization","name":"Data Visualization","list":["D3.js"]},{"icon":"database","name":"Database","list":["MongoDB"]},{"icon":"integration","name":"Integration","list":["JavaScript SDK"]}]},{"type":"header","data":"The Spark from the Hackathon"},{"type":"para","data":"Wierarchy was first conceptualized during a Cognizant's Innovation Team Hackathon, where we secured First Runner-Up. The challenge was to:","highlight":["Cognizant's Innovation Team Hackathon"]},{"type":"list-bar","data":["Identify influential members and discussion topics shaping innovation.","Analyze engagement trends to uncover participation patterns.","Deliver meaningful insights for leadership decision-making."]},{"type":"header","data":"My Contribution"},{"type":"para","data":"Following the Hackathon, I took the initiative to expand the idea into a fully functional Proof of Concept (PoC) to enhance its real-world applicability.","highlight":[]},{"type":"features","data":[{"icon":"designer","title":"Developed the core application","description":" Leveraging the JavaScript SDK to retrieve real-time engagement data from Yammer groups."},{"icon":"extraction","title":"Structured and processed data","description":" For seamless integration with D3.js visualizations."},{"icon":"connecting","title":" Designed and implemented interactive force-directed network charts ","description":" Provided a visual map of engagement patterns within the network and Enabled clickable interactions, linking users to relevant Yammer posts."},{"icon":"insights","title":"Ensured smooth data flow and dynamic visualizations,","description":"Making insights actionable and easily accessible."}]},{"type":"header","data":"Final Takeaway"},{"type":"para","data":"This project, though small in scale, offered a fresh perspective on employee engagement and innovation. My initiative and technical contributions were highly appreciated, demonstrating how data-driven insights can empower better decision-making.","highlight":["how data-driven insights can empower better decision-making."]}]},{"project_id":6,"title":"Portfolio Website","tagline":"More than just Pixels.","tags":["#WebDesign","#PersonalBranding","#SelfExpression"],"content":[{"type":"img-right","icon":"work"},{"type":"list","data":["Do I still have it? "]},{"type":"list","data":["Can I really start from where I left off? "]},{"type":"list","data":["Can I press that 'Play' button and snap back into form?"]},{"type":"list","data":["Can I finish what I started?"]},{"type":"para","data":"The Necessity. Paddling through the swamp of doubts, I scrolled through hundreds of websites, trying to figure out what’s trending in web design —  what’s hot, what’s not, and what would resonate with me and my recruiters. I needed something to reignite my confidence, something simple yet powerful enough to show what I’m truly about.","highlight":["The Necessity."]},{"type":"para","data":"The Notion. Building a professional portfolio would give me a broader canvas to showcase my skills and share more about who I am. The challenge? You’re not just displaying a product or idea —  you’re showcasing YOU. It has to be unique, reflecting what truly matters to you, and it needs to scream your personality.","highlight":["The Notion"]},{"type":"para","data":"The Itch. I could’ve gone with a generic website, maybe let an AI tool build it for me. But that’s just not me. I’ve always had the urge to be creative and different in everything I do. From every word to every color to every pixel —  everything in this website has been thoughtfully crafted by me.","highlight":["The Itch."]},{"type":"para","data":"The Journey. Surprisingly, it turned out to be more than just a display of skills. It became personal—a journey of discovering my strengths, my style, and what I truly want. The process helped me shake off doubts, lifted my spirits, and ended up being a lot more fun than I expected. ","highlight":["The Journey."]},{"type":"para","data":"Now, The Way Forward! I realized what I’d been missing, and what I need to do next. It might not be huge or groundbreaking—just a simple website—but it’s exactly what I needed to get back in form. And that’s what really matters.","highlight":["Now, The Way Forward!"]},{"type":"para","data":"And that’s what this is: ","highlight":[]},{"type":"para-i","data":"The story of this Website —  because sometimes, it’s not just about the pixels; it’s also about the person  and the intent .","highlight":["The story of this Website"]}]}]
